/* Карбовский Сергей, гр. АПО-11
 * Задача 1. Хеш-таблица
 * Реализуйте структуру данных типа “множество строк” на основе динамической хеш-таблицы с открытой адресацией.
 * Хранимые строки непустые и состоят из строчных латинских букв. Начальный размер таблицы должен быть равным 8-ми.
 * Перехеширование выполняйте в случае, когда коэффициент заполнения таблицы достигает 3/4.
 * Структура данных должна поддерживать операции добавления строки в множество, удаления строки из множества и
 * проверки принадлежности данной строки множеству.
 * Для разрешения коллизий используйте двойное хеширование.
 */

#include <iostream>
#include <string>
#include <vector>

//using namespace std;

template <class _T>
class HashMap
{
    //std::vector <_T>
};

int main()
{
    cout << "Hello World!" << endl;
    return 0;
}

